In [3]:
# %matplotlib inline
import pandas as pd

### Download the data and load it to Pandas. 

You can find them [here](https://drive.google.com/file/d/1NY6cmF9Shjw-dD7BD6bNmfcIVz-kQcFR/view?usp=sharing).

In [4]:
titles = pd.read_csv('titles.csv')
titles.head()

                     title  year
0           The Rising Son  1990
1  The Thousand Plane Raid  1969
2         Crucea de piatra  1993
3                  Country  2000
4               Gaiking II  2011

In [5]:
cast = pd.read_csv('cast.csv', sep=",")
cast.head()

                  title  year      name   type                character     n
0        Closet Monster  2015  Buffy #1  actor                  Buffy 4   NaN
1       Suuri illusioni  1985    Homo $  actor                   Guests  22.0
2   Battle of the Sexes  2017   $hutter  actor          Bobby Riggs Fan  10.0
3  Secret in Their Eyes  2015   $hutter  actor          2002 Dodger Fan   NaN
4            Steve Jobs  2015   $hutter  actor  1988 Opera House Patron   NaN

### How many movies are listed in the titles dataframe?

In [7]:
titles.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 232330 entries, 0 to 232329
Data columns (total 2 columns):
 #   Column  Non-Null Count   Dtype
---  ------  --------------   -----
 0   title   232330 non-null  object
 1   year    232330 non-null  int64
dtypes: int64(1), object(1)
memory usage: 3.5+ MB

In [11]:
titles.columns

Index(['title', 'year'], dtype='object')

In [12]:
titles.index

RangeIndex(start=0, stop=232330, step=1)

In [129]:
titles.shape[0]

232330

### What are the earliest two films listed in the titles dataframe?

In [15]:
titles.sort_values(by='year').head(2)

                     title  year
177757          Miss Jerry  1894
215272  The Startled Lover  1898

### How many movies have the title "Hamlet"?

In [123]:
title_hamlet = titles[titles['title']=='Hamlet']
title_hamlet['title'].count()

18

In [126]:
len(titles[titles['title'] == 'Hamlet'])

18

In [131]:
len(titles[titles['title'].str.contains('Hamlet')])

54

In [128]:
import re

In [127]:
titles[titles['title'] contains 'Hamlet']

SyntaxError: invalid syntax (2257107629.py, line 1)

### How many movies are titled "North by Northwest"?

In [132]:
len(titles[titles['title']=='North by Northwest'])

1

### When was the first movie titled "Hamlet" made?

In [37]:
title_hamlet.sort_values(by='year').head(1)

        title  year
46721  Hamlet  1910

### List all of the "Treasure Island" movies from earliest to most recent.

In [41]:
titles[titles['title']=="Treasure Island"].sort_values('year')

                  title  year
206027  Treasure Island  1918
51287   Treasure Island  1920
191050  Treasure Island  1934
96934   Treasure Island  1950
89534   Treasure Island  1972
111343  Treasure Island  1973
205397  Treasure Island  1985
179354  Treasure Island  1999

### How many movies were made in the year 1950?

In [133]:
titles[titles['year']==1950].shape[0]

1099

In [134]:
len(titles[titles['year']==1950])

1099

### How many movies were made in the year 1960?

### How many movies were made from 1950 through 1959?

In [47]:
len(titles[(titles['year']>=1950) & (titles['year']<=1959)])

12711

In [118]:
titles['year'].between(1950,1959).sum() # takes the sum of the true values

12711

In [119]:
len(titles.loc[titles['year'].between(1950, 1959)])

12711

### In what years has a movie titled "Batman" been released?

In [48]:
titles[titles['title'] == 'Batman']

        title  year
56000  Batman  1989
74608  Batman  1943

### How many roles were there in the movie "Inception"?

In [53]:
cast.shape

(3634467, 6)

In [54]:
cast.head()

                  title  year      name   type                character     n
0        Closet Monster  2015  Buffy #1  actor                  Buffy 4   NaN
1       Suuri illusioni  1985    Homo $  actor                   Guests  22.0
2   Battle of the Sexes  2017   $hutter  actor          Bobby Riggs Fan  10.0
3  Secret in Their Eyes  2015   $hutter  actor          2002 Dodger Fan   NaN
4            Steve Jobs  2015   $hutter  actor  1988 Opera House Patron   NaN

In [60]:
cast[cast['title'] == 'Inception']['name'].nunique()

77

In [121]:
cast[cast['title'] == 'Inception']['name'].count()

77

In [122]:
len(cast[cast['title'] == 'Inception'])

77

In [81]:
import numpy as np

### How many roles in the movie "Inception" are NOT ranked by an "n" value?

In [95]:
inception['n'].isna().sum()

26

### But how many roles in the movie "Inception" did receive an "n" value?

In [94]:
inception['n'].count()

51

### Display the cast of "North by Northwest" in their correct "n"-value order, ignoring roles that did not earn a numeric "n" value.

In [99]:
cast[cast['title']=="North by Northwest"][['title','name','n']].sort_values("n").dropna()

                      title                  name     n
845516   North by Northwest            Cary Grant   1.0
3382934  North by Northwest       Eva Marie Saint   2.0
1413409  North by Northwest           James Mason   3.0
3043261  North by Northwest   Jessie Royce Landis   4.0
345822   North by Northwest        Leo G. Carroll   5.0
2941468  North by Northwest  Josephine Hutchinson   6.0
1644542  North by Northwest           Philip Ober   7.0
1236791  North by Northwest         Martin Landau   8.0
2372617  North by Northwest         Adam Williams   9.0
1757154  North by Northwest          Edward Platt  10.0
646039   North by Northwest     Robert Ellenstein  11.0
2225858  North by Northwest          Les Tremayne  12.0
450691   North by Northwest       Philip Coolidge  13.0
1463316  North by Northwest         Patrick McVey  14.0
199768   North by Northwest          Edward Binns  15.0
1343025  North by Northwest             Ken Lynch  16.0

In [100]:
cast[cast['title']=="North by Northwest"]['n'].count()

16

### Display the entire cast, in "n"-order, of the 1972 film "Sleuth".

In [102]:
cast[(cast['title']=='Sleuth')&(cast['year']==1972)].sort_values('n')

,title,year,name,type,character,n
1654402,Sleuth,1972,Laurence Olivier,actor,Andrew Wyke,1.0
316652,Sleuth,1972,Michael Caine,actor,Milo Tindle,2.0
362592,Sleuth,1972,Alec Cawthorne,actor,Inspector Doppler,3.0
1421434,Sleuth,1972,John (II) Matthews,actor,Detective Sergeant Tarrant,4.0
2635708,Sleuth,1972,Eve (III) Channing,actress,Marguerite Wyke,5.0
1405219,Sleuth,1972,Teddy Martin,actor,Police Constable Higgs,6.0

### Now display the entire cast, in "n"-order, of the 2007 version of "Sleuth".

### How many roles were credited in the silent 1921 version of Hamlet?

In [107]:
cast[(cast['title']=='Hamlet')&(cast['year']==1921)]['name'].count()

9

### How many roles were credited in Branaghâ€™s 1996 Hamlet?

### How many "Hamlet" roles have been listed in all film credits through history?

### How many people have played an "Ophelia"?

### How many people have played a role called "The Dude"?

### How many people have played a role called "The Stranger"?

### How many roles has Sidney Poitier played throughout his career?

### How many roles has Judi Dench played?

### List the supporting roles (having n=2) played by Cary Grant in the 1940s, in order by year.

### List the leading roles that Cary Grant played in the 1940s in order by year.

### How many roles were available for actors in the 1950s?

### How many roles were avilable for actresses in the 1950s?

### How many leading roles (n=1) were available from the beginning of film history through 1980?

### How many non-leading roles were available through from the beginning of film history through 1980?

### How many roles through 1980 were minor enough that they did not warrant a numeric "n" rank?